//=============================================================================
// [game.h] ゲームシーン管理
// 
// 制作者：土居秀顕/花山大貴	制作日：2026/01/08
//=============================================================================
#ifndef _GAME_H_	// インクルードガード
#define _GAME_H_
// =============================================================================
// プロトタイプ宣言
// =============================================================================
void InitializeGame(void);	// ゲームシーンの初期化処理
void UpdateGame(void);		// ゲームシーンの更新処理
void DrawGame(void);		// ゲームシーンの描画処理
void FinalizeGame(void);	// ゲームシーンの終了処理

#endif